app/Controllers/Pagamento.php

    public function index()
    {
        $pagadorModel = new PagamentoModel();

        $data['link'] = 'pagamento/inserir';
        $data['tituloRedirect'] = '+ Inserir Novo Pagamento';
        $data['pagamentos'] = $pagadorModel
            ->select('pagamento.*,
                pagamento.id as id_pagamento,
                users.nome as nome_morador,
                recebedor.nome as nome_recebedor,
                endereco.*,
                tipo_pagamento.descricao as desc_pagamento
              ')
            ->join('users', 'users.id = pagamento.id_usuario')
            ->join('recebedor', 'recebedor.id = pagamento.id_recebedor')
            ->join('endereco', 'endereco.id_usuario = users.id')
            ->join('tipo_pagamento', 'tipo_pagamento.id = pagamento.id_tipo_pagamento')
            ->orderBy('pagamento.id', 'DESC')->paginate(10);
---
SELECT COUNT(*) AS `numrows`
FROM `pagamento`
JOIN `users` ON `users`.`id` = `pagamento`.`id_usuario`
JOIN `recebedor` ON `recebedor`.`id` = `pagamento`.`id_recebedor`
JOIN `endereco` ON `endereco`.`id_usuario` = `users`.`id`
JOIN `tipo_pagamento` ON `tipo_pagamento`.`id` = `pagamento`.`id_tipo_pagamento`
SELECT `pagamento`.*, `pagamento`.`id` as `id_pagamento`, `users`.`nome` as `nome_morador`, `recebedor`.`nome` as `nome_recebedor`, `endereco`.*, `tipo_pagamento`.`descricao` as `desc_pagamento`
FROM `pagamento`
JOIN `users` ON `users`.`id` = `pagamento`.`id_usuario`
JOIN `recebedor` ON `recebedor`.`id` = `pagamento`.`id_recebedor`
JOIN `endereco` ON `endereco`.`id_usuario` = `users`.`id`
JOIN `tipo_pagamento` ON `tipo_pagamento`.`id` = `pagamento`.`id_tipo_pagamento`
ORDER BY `pagamento`.`id` ASC
 LIMIT 10

    public function inserir()
    {
        $recebedoresModel = new RecebedorModel();
        $moradorModel = new UserModel();
        $tipoPagamentoModel = new TipoPagamentoModel();

        $data['recebedores'] = $recebedoresModel->orderBy('nome', 'ASC')->findAll();
        $data['moradores'] = $moradorModel->orderBy('nome', 'ASC')->findAll();
        $data['tiposPagamento'] = $tipoPagamentoModel->orderBy('descricao', 'ASC')->findAll();

        $data['link'] = '/pagamentos';
        $data['tituloRedirect'] = 'Voltar para Lista de Pagamentos';
        $data['titulo'] = 'Inserir Pagador';
        $data['acao'] = 'Inserir';
        $data['msg'] = '';

        if ($this->request->getPost()) {
            $pagadorModel = new PagamentoModel();

            $pagadorData = [
                'id_usuario' => $this->request->getPost('morador'),
                'id_recebedor' => $this->request->getPost('recebedor'),
                'id_tipo_pagamento' => $this->request->getPost('tipoPagamento'),
                'data_pagamento' => $this->request->getPost('data_pagamento'),
                'referencia' => $this->request->getPost('referencia'),
                'valor' => $this->request->getPost('valor'),
                'observacao' => $this->request->getPost('observacao'),
                'data_insert' => date('Y-m-d H:i:s'),
            ];

            $pagadorData = $pagadorModel->insert($pagadorData);
---
SELECT *
FROM `recebedor`
ORDER BY `nome` ASC
SELECT *
FROM `users`
ORDER BY `nome` ASC
SELECT *
FROM `tipo_pagamento`
ORDER BY `descricao` ASC
INSERT INTO `pagamento` (`id_usuario`, `id_recebedor`, `data_pagamento`, `referencia`, `valor`, `observacao`, `data_insert`) VALUES ('6', '1', '2024-12-11', '122024', '50', '', '2024-12-11 22:29:12')

    public function editar($id)
    {
        $recebedoresModel = new RecebedorModel();
        $moradorModel = new UserModel();
        $tipoPagamentoModel = new TipoPagamentoModel();
        $pagadorModel = new PagamentoModel();

        $data['recebedores'] = $recebedoresModel->orderBy('nome', 'ASC')->findAll();
        $data['moradores'] = $moradorModel->orderBy('nome', 'ASC')->findAll();
        $data['tiposPagamento'] = $tipoPagamentoModel->orderBy('descricao', 'ASC')->findAll();

        $data['titulo'] = 'Editar Pagamento ' . $id;
        $data['acao'] = 'Atualizar';
        $data['msg'] = '';
        $data['link'] = '/pagamentos';
        $data['tituloRedirect'] = 'Voltar para Lista de Pagamentos';

        $pagamento = $pagadorModel->find($id);
---
SELECT *
FROM `recebedor`
ORDER BY `nome` ASC
SELECT *
FROM `users`
ORDER BY `nome` ASC
SELECT *
FROM `tipo_pagamento`
ORDER BY `descricao` ASC
SELECT *
FROM `pagamento`
WHERE `pagamento`.`id` = '11'