app/Controllers/User.php

    public function index()
    {
        $userModel = new UserModel();
        $data['moradores'] = $userModel->find();
---
SELECT *
FROM `users`

    public function inserir()
    {
        $data['titulo'] = 'Inserir novo usuário';
        $data['acao'] = 'Inserir';
        $data['msg'] = '';
        $data['link'] = 'public/index.php/users';
        $data['tituloRedirect'] = 'Voltar para Lista de Usuários';

        if ($this->request->getPost()) {
            $userModel = new UserModel();
            $enderecoModel = new EnderecoModel();

            $userData = [
                'nome' => $this->request->getPost('nome'),
                'aniversario' => $this->request->getPost('aniversario'),
                'telefone' => $this->request->getPost('telefone'),
                'telefone_2' => $this->request->getPost('telefone_2'),
            ];

            $userId = $userModel->insert($userData, true); // `true` retorna o ID do registro inserido
---
INSERT INTO `users` (`nome`, `aniversario`) VALUES ('Fabio Raphael Araujo Furtado', '1993-05-17')

    public function editar($id)
    {
        $data['titulo'] = 'Editar usuário ' . $id;
        $data['acao'] = 'Atualizar';
        $data['msg'] = '';
        $data['link'] = 'public/index.php/users';
        $data['tituloRedirect'] = 'Voltar para Lista de Usuários';

        $userModel = new UserModel();
        $enderecoModel = new EnderecoModel();

        $usuario = $userModel->find($id);
        $endereco = $enderecoModel->getEnderecoByUsuarioId($id);

        if (!$usuario) {
            return redirect()->to('/users')->with('error', 'Usuário não encontrado.');
        }

        if ($this->request->getPost()) {

            $enderecoModel->where('id_usuario', $id)->set([
                    'rua' => $this->request->getPost('rua'),
                    'numero' => $this->request->getPost('numero'),
                    'quadra' => $this->request->getPost('quadra'),
            ])->update();

            if ($userModel->update($id, [
                'nome' => $this->request->getPost('nome'),
                'aniversario' => $this->request->getPost('aniversario'),
                'telefone' => $this->request->getPost('telefone'),
                'telefone_2' => $this->request->getPost('telefone_2'),
            ])) {
---
SELECT *
FROM `users`
WHERE `users`.`id` = '6'
UPDATE `endereco` SET `rua` = '4', `numero` = '600', `quadra` = '5'
WHERE `id_usuario` = '6'
UPDATE `users` SET `nome` = 'Yasmin Passinho Furtado', `aniversario` = '1993-06-11', `telefone` = '91980647336', `telefone_2` = ''
WHERE `users`.`id` IN ('6')