app/Controllers/User.php

SELECT *
FROM `users`
WHERE `users`.`id` = '6'
---
    public function editar($id)
    {
        $userModel = new UserModel();
        $enderecoModel = new EnderecoModel();

        // Buscar usuário e endereço
        $usuario = $userModel->find($id);