app/Models/EnderecoModel.php

SELECT *
FROM `endereco`
WHERE `id_usuario` = '6'
 LIMIT 1
---
    public function getEnderecoByUsuarioId($usuarioId)
    {
        return $this->where('id_usuario', $usuarioId)->first();